src/main/java/com/soapws/bcxml/freeze.xml

            <!--Freeze Request-->


            <!--<?xml version="1.0" encoding="UTF-8"?>
            <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.fiusb.ci.infosys.com">
                <soapenv:Header/>
                <soapenv:Body>
                    <web:executeService>
                        <arg_0_0>-->
            <Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
                <Body>
                    <executeFreezeService xmlns="http://webservice.fiusb.ci.infosys.com">
                        <arg_0_0 xmlns="">
                            <![CDATA[
                <FIXML xsi:schemaLocation="http://www.finacle.com/fixml executeFinacleScript.xsd" xmlns="http://www.finacle.com/fixml" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <Header>
                        <RequestHeader>
                            <MessageKey>
                                <RequestUUID>Req_1561732068109</RequestUUID>
                                <ServiceRequestId>executeFinacleScript</ServiceRequestId>
                                <ServiceRequestVersion>10.2</ServiceRequestVersion>
                                <ChannelId>CRM</ChannelId>
                                <LanguageId></LanguageId>
                            </MessageKey>
                            <RequestMessageInfo>
                                <BankId></BankId>
                                <TimeZone></TimeZone>
                                <EntityId></EntityId>
                                <EntityType></EntityType>
                                <ArmCorrelationId></ArmCorrelationId>
                                <MessageDateTime>2019-06-28T15:27:48.109</MessageDateTime>
                            </RequestMessageInfo>
                            <Security>
                                <Token>
                                    <PasswordToken>
                                        <UserId></UserId>
                                        <Password></Password>
                                    </PasswordToken>
                                </Token>
                                <FICertToken></FICertToken>
                                <RealUserLoginSessionId></RealUserLoginSessionId>
                                <RealUser></RealUser>
                                <RealUserPwd></RealUserPwd>
                                <SSOTransferToken></SSOTransferToken>
                            </Security>
                        </RequestHeader>
                    </Header>
                    <Body>
                        <executeFinacleScriptRequest>
                            <ExecuteFinacleScriptInputVO>
                                <requestId>customFreeze.scr</requestId>
                            </ExecuteFinacleScriptInputVO>
                            <executeFinacleScript_CustomData>
                                <accountID>5483352014</accountID>
                                <freezeType>D</freezeType>
                                <freezReasonCode>OTH</freezReasonCode>
                                <freezeRemarks>VERIFIED BY 13657:REFER TO BRANCH CONSOLE FOR DETAILS ON customer&#x27;s instruction</freezeRemarks>
                            </executeFinacleScript_CustomData>
                        </executeFinacleScriptRequest>
                    </Body>
                </FIXML>
                ]]>
                        </arg_0_0>
                    </executeFreezeService>
                </Body>
            </Envelope>
                    <!--</arg_0_0>
                </web:executeService>
            </soapenv:Body>
        </soapenv:Envelope>-->



        <!--<?xml version="1.0" encoding="UTF-8"?>
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://webservice.fiusb.ci.infosys.com">
            <soapenv:Header/>
            <soapenv:Body>
                <web:executeService>
                    <arg_0_0>-->
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
<Body>
    <executeService xmlns="http://webservice.fiusb.ci.infosys.com">
        <arg_0_0 xmlns="">
            <![CDATA[
        <FIXML xsi:schemaLocation="http://www.finacle.com/fixml executeFinacleScript.xsd" xmlns="http://www.finacle.com/fixml" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
          <Header>
            <RequestHeader>
              <MessageKey>
                <RequestUUID>Req_1561732016602</RequestUUID>
                <ServiceRequestId>executeFinacleScript</ServiceRequestId>
                <ServiceRequestVersion>10.2</ServiceRequestVersion>
                <ChannelId>CRM</ChannelId>
                <LanguageId></LanguageId>
              </MessageKey>
              <RequestMessageInfo>
                <BankId></BankId>
                <TimeZone></TimeZone>
                <EntityId></EntityId>
                <EntityType></EntityType>
                <ArmCorrelationId></ArmCorrelationId>
                <MessageDateTime>2019-06-28T15:26:56.602</MessageDateTime>
              </RequestMessageInfo>
              <Security>
                <Token>
                  <PasswordToken>
                    <UserId></UserId>
                    <Password></Password>
                  </PasswordToken>
                </Token>
                <FICertToken></FICertToken>
                <RealUserLoginSessionId></RealUserLoginSessionId>
                <RealUser></RealUser>
                <RealUserPwd></RealUserPwd>
                <SSOTransferToken></SSOTransferToken>
              </Security>
            </RequestHeader>
          </Header>
          <Body>
            <executeFinacleScriptRequest>
              <ExecuteFinacleScriptInputVO>
                <requestId>customUnfreezeAcct.scr</requestId>
              </ExecuteFinacleScriptInputVO>
              <executeFinacleScript_CustomData>
                <accountID>6212848019</accountID>
                <freezeType>D</freezeType>
                <freezReasonCode>OUTSD</freezReasonCode>
                <freezeRemarks>REFER TO BRANCH CONSOLE FOR DETAILS ON OUTSTANDING DOCUMENTS</freezeRemarks>
              </executeFinacleScript_CustomData>
            </executeFinacleScriptRequest>
          </Body>
        </FIXML>
        ]]>
        </arg_0_0>
    </executeService>
</Body>
</Envelope>
        <!--</arg_0_0>
                </web:executeService>
            </soapenv:Body>
        </soapenv:Envelope>-->


        <!--Freeze Response-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header/><soapenv:Body><p594:executeServiceResponse xmlns:p594="http://webservice.fiusb.ci.infosys.com"><executeServiceReturn><FIXML xsi:schemaLocation=&quot;http://www.finacle.com/fixml executeFinacleScript.xsd&quot; xmlns=&quot;http://www.finacle.com/fixml&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;>
    <Header>
        <ResponseHeader>
            <RequestMessageKey>
                <RequestUUID>Req_1561732068109</RequestUUID>
                <ServiceRequestId>executeFinacleScript</ServiceRequestId>
                <ServiceRequestVersion>10.2</ServiceRequestVersion>
                <ChannelId>CRM</ChannelId>
            </RequestMessageKey>
            <ResponseMessageInfo>
                <BankId>01</BankId>
                <TimeZone></TimeZone>
                <MessageDateTime>2019-06-28T14:29:49.538</MessageDateTime>
            </ResponseMessageInfo><UBUSTransaction>
            <Id/>
            <Status/>
        </UBUSTransaction>
            <HostTransaction>
                <Id/>
                <Status>SUCCESS</Status>
            </HostTransaction>
            <HostParentTransaction>
                <Id/>
                <Status/>
            </HostParentTransaction>
            <CustomInfo/>
        </ResponseHeader>
    </Header>
    <Body>
        <executeFinacleScriptResponse>
            <ExecuteFinacleScriptOutputVO>
            </ExecuteFinacleScriptOutputVO><executeFinacleScript_CustomData>
            <SuccessOrFailure>SUCCESS</SuccessOrFailure></executeFinacleScript_CustomData>
        </executeFinacleScriptResponse></Body></FIXML></executeServiceReturn></p594:executeServiceResponse></soapenv:Body></soapenv:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header/><soapenv:Body><p594:executeServiceResponse xmlns:p594="http://webservice.fiusb.ci.infosys.com">
    <executeServiceReturn>
        <FIXML xsi:schemaLocation=&quot;http://www.finacle.com/fixml executeFinacleScript.xsd&quot; xmlns=&quot;http://www.finacle.com/fixml&quot; xmlns:xsi=&quot;http://www.w3.org/2001/XMLSchema-instance&quot;>
    <Header>
        <ResponseHeader>
            <RequestMessageKey>
                <RequestUUID>Req_1561732016602</RequestUUID>
                <ServiceRequestId>executeFinacleScript</ServiceRequestId>
                <ServiceRequestVersion>10.2</ServiceRequestVersion>
                <ChannelId>CRM</ChannelId>
            </RequestMessageKey>
            <ResponseMessageInfo>
                <BankId>01</BankId>
                <TimeZone></TimeZone>
                <MessageDateTime>2019-06-28T14:28:58.094</MessageDateTime>
            </ResponseMessageInfo><UBUSTransaction>
            <Id/>
            <Status/>
        </UBUSTransaction>
            <HostTransaction>
                <Id/>
                <Status>SUCCESS</Status>
            </HostTransaction>
            <HostParentTransaction>
                <Id/>
                <Status/>
            </HostParentTransaction>
            <CustomInfo/>
        </ResponseHeader>
    </Header>
    <Body>
        <executeFinacleScriptResponse>
            <ExecuteFinacleScriptOutputVO></ExecuteFinacleScriptOutputVO>
            <executeFinacleScript_CustomData>
                <SuccessOrFailure>SUCCESS</SuccessOrFailure>
            </executeFinacleScript_CustomData>
        </executeFinacleScriptResponse>
    </Body>
</FIXML>
</executeServiceReturn>
</p594:executeServiceResponse>
</soapenv:Body>
        </soapenv:Envelope>